Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxPort_reg.h
/** \brief F8, Port 25 Access Enable Register 1 */
#define P25_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B9F8u)

/** \brief FC, Port 25 Access Enable Register 0 */
#define P25_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B9FCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P26
 * \{  */
/** \brief 0, Port 26 Output Register */
#define P26_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003BA00u)

/** \brief 4, Port 26 Output Modification Register */
#define P26_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003BA04u)

/** \brief 8, Port 26 Identification Register */
#define P26_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003BA08u)

/** \brief 10, Port 26 Input/Output Control Register 0 */
#define P26_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003BA10u)

/** \brief 24, Port 26 Input Register */
#define P26_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003BA24u)

/** \brief 40, Port 26 Pad Driver Mode Register 0 */
#define P26_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003BA40u)

/** \brief 50, Port 26 Emergency Stop Register */
#define P26_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003BA50u)

/** \brief 60, Port 26 Pin Function Decision Control Register */
#define P26_PDISC /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDISC*)0xF003BA60u)

/** \brief 64, Port 26 Pin Controller Select Register */
#define P26_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003BA64u)

/** \brief 70, Port 26 Output Modification Set Register 0 */
#define P26_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003BA70u)

/** \brief 80, Port 26 Output Modification Clear Register 0 */
#define P26_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003BA80u)

/** \brief 90, Port 26 Output Modification Set Register */
#define P26_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003BA90u)

/** \brief 94, Port 26 Output Modification Clear Register */
#define P26_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003BA94u)

/** \brief F8, Port 26 Access Enable Register 1 */
#define P26_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003BAF8u)

/** \brief FC, Port 26 Access Enable Register 0 */
#define P26_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003BAFCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P30
 * \{  */
/** \brief 0, Port 30 Output Register */
#define P30_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003BE00u)

/** \brief 4, Port 30 Output Modification Register */
#define P30_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003BE04u)

/** \brief 8, Port 30 Identification Register */
#define P30_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003BE08u)

/** \brief 10, Port 30 Input/Output Control Register 0 */
#define P30_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003BE10u)

/** \brief 14, Port 30 Input/Output Control Register 4 */
#define P30_IOCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR4*)0xF003BE14u)

/** \brief 18, Port 30 Input/Output Control Register 8 */
#define P30_IOCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR8*)0xF003BE18u)

/** \brief 1C, Port 30 Input/Output Control Register 12 */
#define P30_IOCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR12*)0xF003BE1Cu)

/** \brief 24, Port 30 Input Register */
#define P30_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003BE24u)

/** \brief 40, Port 30 Pad Driver Mode Register 0 */
#define P30_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003BE40u)

/** \brief 44, Port 30 Pad Driver Mode Register 1 */
#define P30_PDR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR1*)0xF003BE44u)

/** \brief 50, Port 30 Emergency Stop Register */
#define P30_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003BE50u)

/** \brief 60, Port 30 Pin Function Decision Control Register */
#define P30_PDISC /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDISC*)0xF003BE60u)

/** \brief 64, Port 30 Pin Controller Select Register */
#define P30_PCSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PCSR*)0xF003BE64u)

/** \brief 70, Port 30 Output Modification Set Register 0 */
#define P30_OMSR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR0*)0xF003BE70u)

/** \brief 74, Port 30 Output Modification Set Register 4 */
#define P30_OMSR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR4*)0xF003BE74u)

/** \brief 78, Port 30 Output Modification Set Register 8 */
#define P30_OMSR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR8*)0xF003BE78u)

/** \brief 7C, Port 30 Output Modification Set Register 12 */
#define P30_OMSR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR12*)0xF003BE7Cu)

/** \brief 80, Port 30 Output Modification Clear Register 0 */
#define P30_OMCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR0*)0xF003BE80u)

/** \brief 84, Port 30 Output Modification Clear Register 4 */
#define P30_OMCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR4*)0xF003BE84u)

/** \brief 88, Port 30 Output Modification Clear Register 8 */
#define P30_OMCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR8*)0xF003BE88u)

/** \brief 8C, Port 30 Output Modification Clear Register 12 */
#define P30_OMCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR12*)0xF003BE8Cu)

/** \brief 90, Port 30 Output Modification Set Register */
#define P30_OMSR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMSR*)0xF003BE90u)

/** \brief 94, Port 30 Output Modification Clear Register */
#define P30_OMCR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMCR*)0xF003BE94u)

/** \brief F8, Port 30 Access Enable Register 1 */
#define P30_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN1*)0xF003BEF8u)

/** \brief FC, Port 30 Access Enable Register 0 */
#define P30_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ACCEN0*)0xF003BEFCu)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_P_Registers_Cfg_P31
 * \{  */
/** \brief 0, Port 31 Output Register */
#define P31_OUT /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OUT*)0xF003BF00u)

/** \brief 4, Port 31 Output Modification Register */
#define P31_OMR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_OMR*)0xF003BF04u)

/** \brief 8, Port 31 Identification Register */
#define P31_ID /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ID*)0xF003BF08u)

/** \brief 10, Port 31 Input/Output Control Register 0 */
#define P31_IOCR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR0*)0xF003BF10u)

/** \brief 14, Port 31 Input/Output Control Register 4 */
#define P31_IOCR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR4*)0xF003BF14u)

/** \brief 18, Port 31 Input/Output Control Register 8 */
#define P31_IOCR8 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR8*)0xF003BF18u)

/** \brief 1C, Port 31 Input/Output Control Register 12 */
#define P31_IOCR12 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IOCR12*)0xF003BF1Cu)

/** \brief 24, Port 31 Input Register */
#define P31_IN /*lint --e(923, 9078)*/ (*(volatile Ifx_P_IN*)0xF003BF24u)

/** \brief 40, Port 31 Pad Driver Mode Register 0 */
#define P31_PDR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR0*)0xF003BF40u)

/** \brief 44, Port 31 Pad Driver Mode Register 1 */
#define P31_PDR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_P_PDR1*)0xF003BF44u)

/** \brief 50, Port 31 Emergency Stop Register */
#define P31_ESR /*lint --e(923, 9078)*/ (*(volatile Ifx_P_ESR*)0xF003BF50u)

